EDT/УТ/src/InformationRegisters/РежимыПроверокДокументовПриИзменении/РежимыПроверокДокументовПриИзменении.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РежимыПроверокДокументовПриИзменении</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ОтключитьПроверку</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбластьПроверкиДанных</name>
    <type>
      <types>EnumRef.ОбластиПроверокИзмененияДанных</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/РежимыПроверокДокументовПриИзменении/ManagerModule.bsl
//если передать ОбластьПроверкиДанных - вернется Истина/Ложь
//если без ОбластьПроверкиДанных - вернется массив разрешенных областей
Функция ПолучитьРазрешенияДокумента(Документ, ОбластьПроверкиДанных = Неопределено) Экспорт
	
	//Асеев 09.02.2024 (Задача № 5227)<<<
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Документ", Документ);
	Если ОбластьПроверкиДанных = Неопределено Тогда
		Запрос.Текст =
		"ВЫБРАТЬ
		|	РежимыПроверокДокументовПриИзмененииСрезПоследних.ОбластьПроверкиДанных КАК ОбластьПроверкиДанных
		|ИЗ
		|	РегистрСведений.РежимыПроверокДокументовПриИзменении.СрезПоследних(, Документ = &Документ) КАК РежимыПроверокДокументовПриИзмененииСрезПоследних
		|ГДЕ
		|	РежимыПроверокДокументовПриИзмененииСрезПоследних.ОтключитьПроверку";
		Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ОбластьПроверкиДанных");
	Иначе
		Запрос.УстановитьПараметр("ОбластьПроверкиДанных", ОбластьПроверкиДанных);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ИСТИНА КАК Поле1
		|ИЗ
		|	РегистрСведений.РежимыПроверокДокументовПриИзменении.СрезПоследних(
		|			,
		|			Документ = &Документ
		|				И ОбластьПроверкиДанных = &ОбластьПроверкиДанных) КАК РежимыПроверокДокументовПриИзмененииСрезПоследних
		|ГДЕ
		|	РежимыПроверокДокументовПриИзмененииСрезПоследних.ОтключитьПроверку";
		Возврат Не Запрос.Выполнить().Пустой();
	КонецЕсли;
	//Асеев 09.02.2024 (Задача № 5227)<<<
	
КонецФункции
